const about = {
  title: 'מאחורי_הקוד,_העיצוב_והקסם',
  

  part1: 'אני יוליה,',
  highlight1: 'המפתחת שלא תצטרכי להסביר לה את הוויב שוב ושוב.',

  part2: 'אני בונה לעסקים שיודעים בדיוק מה הם ורק צריכים מישהי שתבנה את זה נכון. ',
  highlight2: 'אני אוהבת לבנות אתרים שלא מרגישים כמו כולם אלא כמו את',
  part3: 'כל אתר הוא חוויה מהוויב האישי שלך ולא מתבנית ולא כמו של השכן.',
  highlight3: 'מרצון לאתר. מחלום לקוד. מוויב לחוויה שאי אפשר לשכוח.',
  part4: 'אם את מחפשת מישהי שתבין אותך מהמשפט הראשון אני כאן.',

  textCloud:"ארגז הכלים שלי"
};

export default about;
