const about = {
  title: 'מאחורי_הקוד,_העיצוב_והקסם',
  

  part1: 'אני יוליה,',
  highlight1: 'מעצבת תעשייתית שהפכה למפתחת אתרים.',

  part2: 'אני משלבת עין עיצובית, חשיבה טכנולוגית וים של יצירתיות כדי ',
  highlight2: 'לבנות אתרים שלא מרגישים כמו כולם – אלא כמו את',
  part3: 'כל אתר שאני בונה הוא חוויה: ויזואלית, טכנולוגית ורגשית.',
  highlight3: 'אני אוהבת להפוך רעיונות לממשקים, חלומות לקוד, ומותגים – לחוויה שאי אפשר לשכוח.',
  part4: 'אם אתה בעל עסק קטן או מעצב שמחפש מפתחת עם ראש אחר – אני כאן בשבילך.',

  textCloud:"ארגז הכלים שלי"
};

export default about;
